---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.UnavailableDimensionHostReference
source: html/75850503-ab0e-d523-4803-5695e6cf2bb1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.UnavailableDimensionHostReference Property

A dimension reference could not be resolved on the host element.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnavailableDimensionHostReference { get; }
```